nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/adchs/processor/adchs_p32mz0512efe100.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _ADCHS_P32MZ0512EFE100_H
#define _ADCHS_P32MZ0512EFE100_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    ADCHS_ID_0 = _ADCHS_BASE_ADDRESS,
    ADCHS_NUMBER_OF_MODULES = 1

} ADCHS_MODULE_ID;

typedef enum {

    ADCHS_AN0 = 0,
    ADCHS_AN1 = 1,
    ADCHS_AN2 = 2,
    ADCHS_AN3 = 3,
    ADCHS_AN4 = 4,
    ADCHS_AN5 = 5,
    ADCHS_AN6 = 6,
    ADCHS_AN7 = 7,
    ADCHS_AN8 = 8,
    ADCHS_AN9 = 9,
    ADCHS_AN10 = 10,
    ADCHS_AN11 = 11,
    ADCHS_AN12 = 12,
    ADCHS_AN13 = 13,
    ADCHS_AN14 = 14,
    ADCHS_AN15 = 15,
    ADCHS_AN16 = 16,
    ADCHS_AN17 = 17,
    ADCHS_AN18 = 18,
    ADCHS_AN19 = 19,
    ADCHS_AN20 = 20,
    ADCHS_AN21 = 21,
    ADCHS_AN22 = 22,
    ADCHS_AN23 = 23,
    ADCHS_AN24 = 24,
    ADCHS_AN25 = 25,
    ADCHS_AN26 = 26,
    ADCHS_AN27 = 27,
    ADCHS_AN28 = 28,
    ADCHS_AN29 = 29,
    ADCHS_AN30 = 30,
    ADCHS_AN31 = 31,
    ADCHS_AN32 = 32,
    ADCHS_AN33 = 33,
    ADCHS_AN34 = 34,
    ADCHS_AN43 = 43,
    ADCHS_AN44 = 44

} ADCHS_AN_INPUT_ID;

typedef enum {

    ADCHS_CLASS12_AN0 = 0,
    ADCHS_CLASS12_AN1 = 1,
    ADCHS_CLASS12_AN2 = 2,
    ADCHS_CLASS12_AN3 = 3,
    ADCHS_CLASS12_AN4 = 4,
    ADCHS_CLASS12_AN5 = 5,
    ADCHS_CLASS12_AN6 = 6,
    ADCHS_CLASS12_AN7 = 7,
    ADCHS_CLASS12_AN8 = 8,
    ADCHS_CLASS12_AN9 = 9,
    ADCHS_CLASS12_AN10 = 10,
    ADCHS_CLASS12_AN11 = 11

} ADCHS_CLASS12_AN_INPUT_ID;

typedef enum {

    ADCHS_CLASS2_AN5 = 5,
    ADCHS_CLASS2_AN6 = 6,
    ADCHS_CLASS2_AN7 = 7,
    ADCHS_CLASS2_AN8 = 8,
    ADCHS_CLASS2_AN9 = 9,
    ADCHS_CLASS2_AN10 = 10,
    ADCHS_CLASS2_AN11 = 11

} ADCHS_CLASS2_AN_INPUT_ID;

typedef enum {

    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_0_BITS = 0,
    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_1_BITS = 1,
    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_2_BITS = 2,
    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_3_BITS = 3,
    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_4_BITS = 4,
    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_5_BITS = 5,
    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_6_BITS = 6,
    ADCHS_INTERRUPT_BIT_SHIFT_LEFT_7_BITS = 7

} ADCHS_INTERRUPT_BIT_SHIFT_LEFT;

typedef enum {

    ADCHS_DATA_RESOLUTION_6BIT = 0,
    ADCHS_DATA_RESOLUTION_8BIT = 1,
    ADCHS_DATA_RESOLUTION_10BIT = 2,
    ADCHS_DATA_RESOLUTION_12BIT = 3

} ADCHS_DATA_RESOLUTION;

typedef enum {

    ADCHS_SCAN_TRIGGER_SOURCE_NONE = 0,
    ADCHS_SCAN_TRIGGER_SOURCE_GLOBAL_SOFTWARE_EDGE = 1,
    ADCHS_SCAN_TRIGGER_SOURCE_SOFTWARE_LEVEL = 2,
    ADCHS_SCAN_TRIGGER_SOURCE_INT0 = 4,
    ADCHS_SCAN_TRIGGER_SOURCE_TMR1_MATCH = 5,
    ADCHS_SCAN_TRIGGER_SOURCE_TMR3_MATCH = 6,
    ADCHS_SCAN_TRIGGER_SOURCE_TMR5_MATCH = 7,
    ADCHS_SCAN_TRIGGER_SOURCE_OC1 = 8,
    ADCHS_SCAN_TRIGGER_SOURCE_OC3 = 9,
    ADCHS_SCAN_TRIGGER_SOURCE_OC5 = 10,
    ADCHS_SCAN_TRIGGER_SOURCE_COUT1 = 11,
    ADCHS_SCAN_TRIGGER_SOURCE_COUT2 = 12

} ADCHS_SCAN_TRIGGER_SOURCE;

typedef enum {

    ADCHS_CHARGEPUMP_DISABLE = 0,
    ADCHS_CHARGEPUMP_ENABLE = 1

} ADCHS_CHARGEPUMP_MODE;

typedef enum {

    ADCHS_FAST_SYNC_SYSTEM_CLOCK_DISABLE = 0,
    ADCHS_FAST_SYNC_SYSTEM_CLOCK_ENABLE = 1

} ADCHS_FAST_SYNC_SYSTEM_CLOCK;

typedef enum {

    ADCHS_FAST_SYNC_PERIPHERAL_CLOCK_DISABLE = 0,
    ADCHS_FAST_SYNC_PERIPHERAL_CLOCK_ENABLE = 1

} ADCHS_FAST_SYNC_PERIPHERAL_CLOCK;

typedef enum {

    ADCHS_OUTPUT_DATA_FORMAT_INTEGER = 0,
    ADCHS_OUTPUT_DATA_FORMAT_FRACTIONAL = 1

} ADCHS_OUTPUT_DATA_FORMAT;

typedef enum {

    ADCHS_DMA_BUFFER_LENGTH_NONE

} ADCHS_DMA_BUFFER_LENGTH;

typedef enum {

    ADCHS_DMA_GLOBAL_NONE

} ADCHS_DMA_GLOBAL;

typedef enum {

    ADCHS_DMA_BUFFER_FULL_INTERRUPT_NONE

} ADCHS_DMA_BUFFER_FULL_INTERRUPT;

typedef enum {

    ADCHS_DMA_COUNT_NONE

} ADCHS_DMA_COUNT;

typedef enum {

    ADCHS_CVD_CAPACITOR_0PF = 0,
    ADCHS_CVD_CAPACITOR_2_5PF = 1,
    ADCHS_CVD_CAPACITOR_5PF = 2,
    ADCHS_CVD_CAPACITOR_7_5PF = 3,
    ADCHS_CVD_CAPACITOR_10PF = 4,
    ADCHS_CVD_CAPACITOR_12_5PF = 5,
    ADCHS_CVD_CAPACITOR_15PF = 6,
    ADCHS_CVD_CAPACITOR_17_5PF = 7

} ADCHS_CVD_CAPACITOR;

typedef enum {

    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_1 = 0,
    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_2 = 1,
    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_3 = 2,
    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_4 = 3,
    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_5 = 4,
    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_6 = 5,
    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_7 = 6,
    ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK_8 = 7

} ADCHS_EARLY_INTERRUPT_PRIOR_CLOCK;

typedef enum {

    ADCHS_CLOCK_SOURCE_PBCLK = 0,
    ADCHS_CLOCK_SOURCE_FRC = 1,
    ADCHS_CLOCK_SOURCE_RFCLK3 = 2,
    ADCHS_CLOCK_SOURCE_SYSCLK = 3

} ADCHS_CLOCK_SOURCE;

typedef enum {

    ADCHS_VREF_AVDD_AVSS = 0,
    ADCHS_VREF_EXTVREFP_AVSS = 1,
    ADCHS_VREF_AVDD_EXTVREFN = 2,
    ADCHS_VREF_EXTVREFP_EXTVREFN = 3

} ADCHS_VREF_SOURCE;

typedef enum {

    ADCHS_CHANNEL_0 = 0,
    ADCHS_CHANNEL_1 = 1,
    ADCHS_CHANNEL_2 = 2,
    ADCHS_CHANNEL_3 = 3,
    ADCHS_CHANNEL_4 = 4,
    ADCHS_CHANNEL_7 = 7

} ADCHS_CHANNEL_ID;

typedef enum {

    ADCHS_CHANNEL_0_DEFAULT_INP_AN0 = 0,
    ADCHS_CHANNEL_1_DEFAULT_INP_AN1 = 4,
    ADCHS_CHANNEL_2_DEFAULT_INP_AN2 = 8,
    ADCHS_CHANNEL_3_DEFAULT_INP_AN3 = 12,
    ADCHS_CHANNEL_4_DEFAULT_INP_AN4 = 16,
    ADCHS_CHANNEL_0_ALTERNATE_INP_AN45 = 1,
    ADCHS_CHANNEL_1_ALTERNATE_INP_AN46 = 5,
    ADCHS_CHANNEL_2_ALTERNATE_INP_AN47 = 9,
    ADCHS_CHANNEL_3_ALTERNATE_INP_AN48 = 13,
    ADCHS_CHANNEL_4_ALTERNATE_INP_AN49 = 17

} ADCHS_CHANNEL_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN0 = 0,
    ADCHS_ALTERNATE_CLASS1_AN45 = 1

} ADCHS_CHANNEL_0_INP_SEL;

typedef enum {

    ADCHS_DEFAULT_CLASS1_AN1 = 4,
    ADCHS_ALTERNATE_CLASS1_AN46 = 5

} ADCHS_CHANNEL_1_INP_SEL;

